In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("wtht.csv")

In [3]:
df

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [4]:
df.describe()

             Height        Weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989699

In [5]:
q1=df.Height.quantile(0.25)
q3=df.Height.quantile(0.75)

In [6]:
iqr=q3-q1
iqr

5.668641245615746

In [7]:
ll=q1-iqr*1.5
ul=q3+iqr*1.5
ll,ul

(55.00265861279534, 77.67722359525831)

In [8]:
df[(df.Height<ll)|(df.Height>ul)]

      Gender     Height      Weight
994     Male  78.095867  255.690835
1317    Male  78.462053  227.342565
2014    Male  78.998742  269.989699
3285    Male  78.528210  253.889004
3757    Male  78.621374  245.733783
6624  Female  54.616858   71.393749
7294  Female  54.873728   78.606670
9285  Female  54.263133   64.700127

In [9]:
df_noheight_outliers=df[(df.Height>ll)&(df.Height<ul)]
df_noheight_outliers

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[9992 rows x 3 columns]

In [10]:
df.describe()

             Height        Weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989699

In [11]:
q1_=df.Weight.quantile(0.25)
q3_=df.Weight.quantile(0.75)

In [12]:
iqr_=q3_-q1_
iqr_

51.35147356318197

In [13]:
ll_=q1_-iqr_*1.5
ul_=q3_+iqr_*1.5
ll_,ul_

(58.79084096072856, 264.19673521345646)

In [14]:
df[(df.Weight<ll_)|(df.Weight>ul_)]

     Gender     Height      Weight
2014   Male  78.998742  269.989699

In [15]:
df_noweight_outliers=df[(df.Weight>ll_)&(df.Weight<ul_)]

In [71]:
df_noweight_outliers

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[9999 rows x 3 columns]

In [73]:
df.shape[0]-df_noweight_outliers.shape[0]

1